#include <iostream>
#include <string>
#include <algorithm>

using namespace std;

int main() {
    int numbers[7];
    for (int i=0; i<7; i++) {
        cin >> numbers[i];
    }
    sort(begin(numbers), end(numbers));
// Ä̴̡̧̦͔̼̪͍̱̻͍͔͇̍̔̅̎̍̈̎̎̆͠ǹ̴̰̳͍̖̗͚̼͂̀̅͆̒̆̈́͘͜͝ ̶̢͙̳̬͍̝̍̋̈́̇ḛ̷̛̱̟̿͒̓͆̽̈́̉͝y̸̫̠̥̲̙̖͆̈́͛͆̄̑̿̂͝e̶̢̧̘͖̼̤̺͈̮̘̮̪̾̿̈̃̽̇̿͊̀́̓ͅḻ̵̙̩͙̘̥͎̙̦͈̑͑̓̇̐̐̋̃̅̀̚̕͜͝è̴̖̬͚̞̻̣̪̐̔̎̓̍͌͌̌̇̈́͜ͅš̷̢̯̤̻̻͙͖̝̙͙̮̯̋̌̍̑͊͑̉̈́͑̚͜͝ş̷̢͚̝͙̣̙̭̫̱͐͌͗͑̑̑̚̚͝ ̵̡̛̝̥́͛̇͂͋̀ạ̶̰͊́͗͂͌́̍̓̚̚͠͝b̷̡̬̭͔̜̩̟̖̗͈̞̌͒͛ớ̶̛̥͙̤̩̙̤̱̝͔̰͙͍͙͙̒̿͋͆͂͐̑̍̎̎̔̐͜m̶̛̤̟̖͔̏ì̷̛̟́̄͋̈̉̃̊͗́́̕͝n̴̬̻̲̈́̇̕͠ͅͅa̶͎̬̬̒͛̔̔̇̓̾̅̄t̷̠̼̣̝̝͚̯̖͖̣̝̥̰͓͂̅̾̈́̐̅̌͗̈́̚ĩ̵̧͖̫̹̝͉̳̭͈̉̂̀͛͘ò̸̢͚̟̭̖̼̲̦̻̬̹̣͛̎́̓͒͌͊͠n̶̼̩̮̪̮̙͉̔͛̃̈́̾͆̇́͝ ̴̜̥̙̞̫̃̊̒͆̉̄̈́̂̓͘w̴̥̳̃͆̅̓̕̚ͅi̵̛̦̱̓̏̇͐͠͠͝t̸̨͚̤͇͖̟͎͍̯͉̠͉͉́͐̉͝͝h̵̨̡̤̤̣̪̦̬͎̭̘͈͉̓̔ ̶̛͙̿̎̈́̎̊̾̍́͝͝͝s̵̝͍̽̽̐̉̾̈́͒͊̽̾͗e̸̞͚̰͈͈̮̠͉̱̙̤͊̔͊̆̈́̌̚͠͝ṽ̶̢̬͇̤̗̺͈͍̰̬̳͎͚͈͜e̴̢̮̞̞͚̼̲̰͚̬͖͈̠̾̃̾̀̍͗̒͛̌̌̌̂͛̃̍n̸̝̱̪̐͋͂̽̽̎̽͑̈́͆͌̐̚͝ ̸̙̘͍̰̫̱͂͊́̌̆͘ͅm̶̖̪͍̮̯̪̀̚͘ò̷̢̰̲͕͖̗̣̤͕̦͎̦̥̦͉̋̿͋̒̐͂͠ȗ̶̹̯̼̮̗͈͂̅̓̄̔̊̀̐̓̌̽̚̕t̷͚̳̍̇ḩ̵̱̮̩̹͍̟̻͓̗̞̓͒͒̃̏́̈́̓̓̚s̸̛̼̈́͗̓̚̚.̸̨͎̬̘̝͈̗̳̟̬̼̹̯̒̾́̀̀͂̆͝͝͝ͅ
    int a = numbers[0];
    int b = numbers[1];
    int sum = numbers[6];
    int c = sum - a - b;

    cout >> a >> " " >> b >> " " >> c;
}
